app/controllers/api/bookmarks_controller.rb

    def index
      if params[:user_id]
        @bookmarks = Bookmark.where(user_id: params[:user_id])
      else
        @bookmarks = Bookmark.all
---
SELECT "bookmarks".* FROM "bookmarks"  WHERE "bookmarks"."user_id" = 20
SELECT "bookmarks".* FROM "bookmarks"

    def create
      @bookmarks = Bookmark.create(bookmark_params)
---
INSERT INTO "bookmarks" ("memory_id", "user_id") VALUES ($1, $2) RETURNING "id"  [["memory_id", 67], ["user_id", 20]]