app/controllers/api/home_controller.rb

    def index
      @memories = Memory.all
---
SELECT "memories".* FROM "memories"