app/controllers/api/memories_controller.rb

    def index
<<<<<<< HEAD
<<<<<<< HEAD
      if params[:id]
         @memories = Memory.where(id: params[:id])
      elsif params[:user_id] && params[:search]
=======

      if params[:user_id] && params[:search]
>>>>>>> 5f66ed1c07c69f7499c4bef271f29a90da9a8636
=======
      if params[:id]
         @memories = Memory.where(id: params[:id])
      elsif params[:user_id] && params[:search]
>>>>>>> 814fa8868954ec7d0b4678da5f0f2faf8c9aa8ec
        @memories = Memory.where(user_id: params[:user_id], city: params[:search])
      elsif params[:user_id] && params[:city]
        @memories = Memory.where(user_id: params[:user_id], city: params[:city])
      elsif params[:user_id]
        @memories = Memory.where(user_id: params[:user_id])
      elsif params[:search]
        if params[:search].blank?
          @memories = Memory.all
---
SELECT "memories".* FROM "memories"  WHERE "memories"."id" = 59
SELECT "memories".* FROM "memories"  WHERE "memories"."user_id" = 1
SELECT "memories".* FROM "memories"  WHERE "memories"."city" = 'sdfsdfd'

    def show
      @memory = Memory.find(params[:id])
---
SELECT  "memories".* FROM "memories"  WHERE "memories"."id" = $1 LIMIT 1  [["id", 1]]

    def create
      @memory = Memory.create(memory_params)
---
INSERT INTO "memories" ("category", "city", "created_at", "description", "google_place_id", "latitude", "longitude", "media_url", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def destroy
      @memory = Memory.find(params[:id])
      @memory.destroy
---
SELECT  "memories".* FROM "memories"  WHERE "memories"."id" = $1 LIMIT 1  [["id", 71]]
DELETE FROM "memories" WHERE "memories"."id" = $1  [["id", 71]]