app/controllers/api/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
      @memories = User.all