app/views/home/index.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 20]]
---
<<<<<<< HEAD
  <% @current_user =  User.find(session["user_id"]) %>