app/controllers/memories_controller.rb

SELECT "memories".* FROM "memories"
---
  def index
    @memories = Memory.all

INSERT INTO "memories" ("category", "created_at", "description", "media_url", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["category", ""], ["created_at", "2015-05-18 22:36:28.532994"], ["description", "12"], ["media_url", "images.jpg"], ["title", "Testing`"], ["updated_at", "2015-05-18 22:36:28.532994"]]
---
  def create
    @memory = Memory.create(memory_params)