app/controllers/users_controller.rb

INSERT INTO "users" ("biography", "created_at", "email", "facebook", "first_name", "last_name", "password_digest", "profile_photo", "twitter", "updated_at", "website") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save